import { Typography, Button, Paper, Container } from '@mui/material';
import { teal } from '@mui/material/colors';

const AboutBusiness = () => {

  return (
    <Container maxWidth="lg" sx={{ paddingTop: 4 }}>
      <Paper
        sx={{
          padding: 4,
          borderRadius: 2,
          backgroundColor: teal[50],
          boxShadow: 3,
          color: '#333',
          direction: 'rtl',
          overflow: 'hidden',
        }}
      >
        <Typography variant="h3" sx={{ color: teal[700], fontWeight: 'bold', marginBottom: 3 }}>
          אודות המשרד
        </Typography>

        <Typography
          variant="h6"
          sx={{
            fontStyle: 'italic',
            color: teal[500],
            marginBottom: 2,
            textAlign: 'center',
          }}
        >
          "אדריכל בונה עבורך כיום אך דואג שאתה תאהב לחיות שם גם מחר" (אלי ומקס קינן)
        </Typography>

        <Typography sx={{ marginBottom: 3 }}>
          קינן אדריכלות ועיצוב פנים הוא משרד אדריכלות ועיצוב פנים המנוהל על ידי אלי ומקס קינן, שני אחים שותפים שכל אחד מהם מביא לתהליכי העבודה והיצירה המשותפים את התשוקה האדירה שלו לתחום האדריכלות ועולמות עיצוב הפנים.
          לרשות המשרד, ניסיון עשיר ומגוון בהליכי תכנון אדריכלי ותהליכי עיצוב פנים של מאות פרויקטים מורכבים מסוגים שונים, לרבות, בתים פרטיים, וילות, דירות יוקרה, משרדים, חללי תצוגה, חנויות קונספט ומבנים שונים אשר תוכננו ונבנו על ידי האחים לבית קינן.
        </Typography>

        <Typography variant="h4" sx={{ color: teal[700], marginBottom: 2 }}>
          100% הקשבה. 100% התאמה
        </Typography>
        <Typography sx={{ marginBottom: 3 }}>
          אחד מהיבטים המרכזיים המלווים את חדוות העשייה והיצירה בקינן אדריכלות ועיצוב פנים בא לידי ביטוי ביכולות ההקשבה המלאה לכלל הצרכים התכנוניים של כל אחד ואחת מלקוחות המשרד, וכל זאת תוך בירור מעמיק של כל החלומות הטמונים בכל לקוח/ה בנוגע לאופי המבנה והחלל המיועד להם.
          באופן זה, הליכי התכנון מותאמים הלכה למעשה לצרכי הלקוחות תוך הקפדה יתרה על כל אחת מההחלטות הגדולות והקטנות הנלוות לתהליכי התכנון.
        </Typography>

        <Typography variant="h4" sx={{ color: teal[700], marginBottom: 2 }}>
          100% ליווי מקצועי לאורך כל הדרך
        </Typography>
        <Typography sx={{ marginBottom: 3 }}>
          שיטת העבודה המיושמת בקינן אדריכלות ועיצוב פנים מאפשרת לכם ליהנות מהליך ליווי מקצועי לאורך כל שלבי התכנון והביצוע של הפרויקט, כאשר המעורבות האישית של אלי ומקס קינן, באה לידי ביטוי בכל אחד מהפרטים הקטנים והגדולים המרכיבים את צרכי הפרויקט, מרמת התכנון, דרך בחירת חומרי גלם, בחירת ספקים וניהול קבלני העבודה ועד לרמת מעורבות מקצועית בבחירת פריטי ריהוט, גופי תאורה ואלמנטים דקורטיביים נוספים.
        </Typography>

        <Typography variant="h4" sx={{ color: teal[700], marginBottom: 2 }}>
          100% פרשנות עיצובית לכל חלום
        </Typography>
        <Typography sx={{ marginBottom: 3 }}>
          כמשרד המתמחה בעולמות התכנון האדריכלי ועיצוב הפנים, בקינן אדריכלות ועיצוב פנים, מושם דגש מקצועי על מתן פרשנות עיצובית לכל חלום או רעיון תוך התאמה מדויקת לצרכי הלקוחות ולכל אחד מהטרנדים העדכניים ביותר בתחום האדריכלות ועיצוב פנים.
          לצורך כך, אלי ומקס קינן, מקפידים לבקר בתערוכות, מיזמים וכנסים בינלאומיים ולהביא ללקוחותיהם את הדבר הבא בתחום האדריכלות ועיצוב פנים כבר היום.
        </Typography>

        <Typography variant="h4" sx={{ color: teal[700], marginBottom: 2 }}>
          100% מחויבות לכל לקוח/ה
        </Typography>
        <Typography sx={{ marginBottom: 3 }}>
          בקינן אדריכלות ועיצוב פנים, תוכלו להבטיח לעצמכם שירות אישי ומחייב לאורך כל שלבי הפרויקט ולהסתייע במגוון רחב של שירותים מקצועיים המותאמים לכל אחד משלבי הפרויקט, מרמת התכנון ועד מסירת מפתח.
          היקף פתרונות השירות המוצעים לכם על ידי אלי ומקס קינן, חולשים למעשה על כל צרכי התכנון האדריכלי ותהליכי עיצוב פנים, תוך הקפדה יתרה על שביעות רצון הלקוחות בכל רגע ורגע.
        </Typography>

        <Typography sx={{ fontSize: '1.1rem' }}>
          לתיאום פגישת ייעוץ ראשונית ולא מחייבת{' '}
          <Button component="a" href="/meetings" sx={{ color: teal[700], textDecoration: 'underline' }}>
            לחצו כאן
          </Button>
        </Typography>
      </Paper>
    </Container>
  );
};

export default AboutBusiness;